Did some quick testing and looks good to me:

```
Terraform will perform the following actions:

  # module.postgresql_database.module.postgresql_database.juju_application.postgresql must be replaced
-/+ resource "juju_application" "postgresql" {
      ~ id          = "dbaas-stg-is-dbaas-testing:postgresql" -> (known after apply)
      ~ model_type  = "iaas" -> (known after apply)
        name        = "postgresql"
      ~ placement   = "3,4,5" -> (known after apply)
      + principal   = (known after apply)
      ~ storage     = [
          - {
              - count = 1 -> null
              - label = "pgdata" -> null
              - pool  = "rootfs" -> null
              - size  = "49G" -> null
            },
          - {
              - count = 1 -> null
              - label = "pgdata-1" -> null
              - pool  = "rootfs" -> null
              - size  = "49G" -> null
            },
          - {
              - count = 1 -> null
              - label = "pgdata-2" -> null
              - pool  = "rootfs" -> null
              - size  = "49G" -> null
            },
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ charm {
          ~ base     = "ubuntu@22.04" -> "ubuntu@24.04" # forces replacement
            name     = "postgresql"
          ~ series   = "jammy" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

Thanks!